<details><summary>Digger run report at 2024-08-01 18:53:05 (UTC)</summary>
  <details><summary>Apply for <b>anzeha/floorball-fantasy-infra#staging_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # google_compute_address.nat will be created
  + resource "google_compute_address" "nat" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "gke-1-staging-nat-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "floorball-fantasy"
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_router.this will be created
  + resource "google_compute_router" "this" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-1-staging-cloud-router"
      + network            = "gke-network-staging"
      + project            = "floorball-fantasy"
      + region             = "europe-west4"
      + self_link          = (known after apply)
    }

  # module.cloud-nat.google_compute_router_nat.main will be created
  + resource "google_compute_router_nat" "main" {
      + auto_network_tier                   = (known after apply)
      + enable_dynamic_port_allocation      = false
      + enable_endpoint_independent_mapping = false
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = 64
      + name                                = "gke-1-cloud-nat"
      + nat_ip_allocate_option              = "MANUAL_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "floorball-fantasy"
      + region                              = "europe-west4"
      + router                              = "gke-1-staging-cloud-router"
      + source_subnetwork_ip_ranges_to_nat  = "LIST_OF_SUBNETWORKS"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + subnetwork {
          + name                     = "gke-subnet-staging"
          + secondary_ip_range_names = [
              + "ip-range-pods",
              + "ip-range-services",
            ]
          + source_ip_ranges_to_nat  = [
              + "LIST_OF_SECONDARY_IP_RANGES",
              + "PRIMARY_IP_RANGE",
            ]
        }
    }

  # module.cloud-nat.random_string.name_suffix will be created
  + resource "random_string" "name_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.10.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "gke-subnet-staging"
      + network                    = "gke-network-staging"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "floorball-fantasy"
      + purpose                    = (known after apply)
      + region                     = "europe-west4"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.30.0.0/16"
              + range_name    = "ip-range-pods"
            },
          + {
              + ip_cidr_range = "10.70.0.0/16"
              + range_name    = "ip-range-services"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + enable_ula_internal_ipv6                  = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 0
      + name                                      = "gke-network-staging"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "floorball-fantasy"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
module.vpc.module.vpc.google_compute_network.network: Creating...
google_compute_address.nat: Creating...
google_compute_address.nat: Creation complete after 1s [id=projects/floorball-fantasy/regions/europe-west4/addresses/gke-1-staging-nat-ip]
module.cloud-nat.random_string.name_suffix: Creating...
module.cloud-nat.random_string.name_suffix: Creation complete after 0s [id=9zj0wk]
module.vpc.module.vpc.google_compute_network.network: Still creating... [10s elapsed]
module.vpc.module.vpc.google_compute_network.network: Still creating... [20s elapsed]
module.vpc.module.vpc.google_compute_network.network: Creation complete after 21s [id=projects/floorball-fantasy/global/networks/gke-network-staging]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"]: Creating...
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"]: Still creating... [10s elapsed]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"]: Still creating... [20s elapsed]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"]: Still creating... [30s elapsed]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"]: Creation complete after 33s [id=projects/floorball-fantasy/regions/europe-west4/subnetworks/gke-subnet-staging]
google_compute_router.this: Creating...
google_compute_router.this: Still creating... [10s elapsed]
google_compute_router.this: Creation complete after 11s [id=projects/floorball-fantasy/regions/europe-west4/routers/gke-1-staging-cloud-router]
module.cloud-nat.google_compute_router_nat.main: Creating...
module.cloud-nat.google_compute_router_nat.main: Still creating... [10s elapsed]
module.cloud-nat.google_compute_router_nat.main: Creation complete after 11s [id=floorball-fantasy/europe-west4/gke-1-staging-cloud-router/gke-1-cloud-nat]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

Outputs:

vpc_network_name = "gke-network-staging"
vpc_subnetwork_name = "gke-subnet-staging"

  ```
</details>
</details>